CSI API ETABS v1
cAreaElm.GetPoints Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPoints(
	string Name,
	ref int NumberPoints,
	ref string[] Point
)
Function GetPoints (
	Name As String,
	ByRef NumberPoints As Integer,
	ByRef Point As String()
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim NumberPoints As Integer
Dim Point As String()
Dim returnValue As Integer
returnValue = instance.GetPoints(Name,
	NumberPoints, Point)
int GetPoints(
	String^ Name,
	int% NumberPoints,
	array<String^>^% Point
)
abstract GetPoints :
        Name : string *
        NumberPoints : int byref *
        Point : string[] byref -> int
Parameters
Name
Type: System.String
NumberPoints
Type: System.Int32
Point
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace